text = input('Введите текст: ')
char = input('Введите символ, который нужно заменить: ')
char_new = input(f'Введите символ, на который нужно заменить символ "{char}": ')
################################################################################
#                        Этот код по теме урока                                #
################################################################################
# text = list(text)
# text_new = []
# for sym in text:
#     if sym != char:
#         text_new.append(sym)
#     else:
#         text_new.append(char_new)
# for sym in text_new:
#     print(sym, end='')
##############################################################################
#                        Этот код по красоте                                 #
##############################################################################
text_new = text.replace(char, char_new)
print(text_new)